#### ✅ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-08T23:23:11Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base



Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Finding latest version of hashicorp/external...
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Installing hashicorp/external v2.3.5...
- Installed hashicorp/external v2.3.5 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=matchpoint-runners]
terraform_data.setup_spotctl_config: Refreshing state... [id=28e19691-e59e-726f-789c-9b6a9601c876]
terraform_data.wait_for_cluster: Refreshing state... [id=00552ded-818c-a14d-9136-f383592e016c]
data.external.kubeconfig: Reading...
data.external.kubeconfig: Read complete after 6s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # spot_spotnodepool.this will be created
  + resource "spot_spotnodepool" "this" {
      + autoscaling          = {
          + max_nodes = 25
          + min_nodes = 4
        }
      + bid_price            = 0.35
      + bid_status           = (known after apply)
      + cloudspace_name      = "matchpoint-runners"
      + desired_server_count = (known after apply)
      + id                   = (known after apply)
      + last_updated         = (known after apply)
      + name                 = (known after apply)
      + server_class         = "gp.vs1.xlarge-dfw"
      + won_count            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_token          = (sensitive value)
  ~ kubeconfig_raw         = (sensitive value)
  ~ nodepool_name          = "db6b5a18-41a4-4d75-9ed5-da36cb86f2e2" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
helm_release.argocd: Refreshing state... [id=argocd]

No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
```
</details>